%Значення факторних змінних
x1=[12.01 27.2 29.33 48.27 40.53 41.17 19.47 39.87 4.83 45.24 46.02 25.01 28.47 36.59 14.93 15.27 ... 
    20.87 47.72 34.41 42.57 4.69 37.56 4.06 25.8 31.06 46.88 21.38 17.1 19.52 21.9 26.51 8.15 28.53 ... 
    38.25 4.1 22.5 5.87 28.53 44.64 8.17 42.97 20.96 32.4 11.85 14]' %8

x2=[0.81 1.2 1.58 2.39 0.66 0.5 1.12 0.66 0.53 1.48 0.9 0.68 1.18 1.81 0.85 0.94 2.39 0.16 0.76 0.2 ...
    0.45 0.52 0.84 2.18 1.66 2.34 0.52 1.52 0.28 0.56 1.41 1.95 2.37 2.24 2.05 1.89 0.47 1.42 2.38 ...
    0.59 0.42 2.28 1.69 1.71 0.5]'; %9

x3=[74.96 73.61 22.77 57.86 8.18 83.73 87.81 94.6 30.57 74.62 98.58 99.52 46.82 18.07 5.08 15.53 9.45 ...
    47.64 0.03 55.39 14.92 9.39 38.25 0.08 21.25 3.01 11.51 50.53 0.48 89.9 6.7 32.01 9.32 17.47 75.1 ...
    50.76 71.55 31.96 55.95 1.51 85.3 7.5 61.08 26.79 16.22]'; %10

y=[15 10.3 4.5 -0.5 -4.5 2.9 14.2 4.6 13.6 0.9 2.4 11.8 6.3 -0.7 5.6 7.7 3 -4.1 -1 1.6 11.8 -3.9 13.6 ... 
   2.7 1.2 -7.6 3.5 9.2 6.2 11.8 2.2 12.5 1.3 -3.4 18.4 10.1 18.2 3.8 0.8 9.9 4.8 5 6.4 10.2 9.2]'%15

alfa=0.01;% рівень значимості
n=length(y) %к-сть спостережень
p=2; %к-сть факторних змінних для рівн регресії

%матриця кореляції
A1=corrcoef(x1,y);
A2=corrcoef(x2,y);
A3=corrcoef(x3,y);
A4=corrcoef(x1,x2);
A5=corrcoef(x1,x3);
A6=corrcoef(x2,x3);

A=[1 A1(2) A2(2) A3(2);
   A1(2) 1 A4(2) A5(2);
   A2(2) A4(2) 1 A6(2);
   A3(2) A5(2) A6(2) 1]

%Будуємо таблицю матриці кореляції
Corrmatrix=table(A(:,1),A(:,2),A(:,3),A(:,4),'RowNames', ...
{'y';'x1';'x2';'x3'},'VariableNames',{'y';'x1';'x2';'x3'})

%...Алгоритм відбору факторних ознак
if abs(A1(2))>abs(A2(2))&&abs(A3(2))>abs(A2(2))&&abs(A5(2))<0.8
  fprintf('обираємо х1 і х3')
  X1=x1;
  X2=x3;
elseif abs(A2(2))>abs(A1(2))&&abs(A3(2))>abs(A1(2))&&abs(A6(2))<0.8
  fprintf('обираємо х2 і х3')
  X1=x2;
  X2=x3;
else 
  fprintf('обираємо х1 і х2')
  X1=x1;
  X2=x2;
end

%Метод найменших квадратів MATLAB
C=[n sum(X1) sum(X2);
    sum(X1) sum(X1.^2) sum(X2.*X1);
    sum(X2) sum(X2.*X1) sum(X2.^2)]
C1=[sum(y) sum(X1.*y) sum(y.*X2)]'
%розвязуємо систему лінійних рівнянь
CC=linsolve(C,C1)
%коефіцієнти рівняння регресії
a=CC(1)
b1=CC(2)
b2=CC(3)
%вигляд рівняння
Y1=a+b1.*X1+b2.*X2
Y11=table(Y1(1:9,:),Y1(10:18,:),Y1(19:27,:),Y1(28:36,:),Y1(37:45,:))
Y11.Properties.VariableNames={'Index_1_9';'Index_10_18';'Index_19_27';'Index_28_36';'Index_37_45'}

figure(1)
plot(y,'LineWidth',1.5)
hold on
plot(Y1)

%...коефіцієнт множинної регресії
R=(1-((sum((Y1-y).^2))/(sum((y-mean(y)).^2))))^0.5

%...коеф детерминации
R2=R^2
if R==1
    fprintf('Зв`язок функціональний')
else
     fprintf('Зв`язок не функціональний')
end

%...Критерій Фішера
F=(R2/(1-R2))*((n-p-1)/p)
Ftab=finv(1-alfa,p,(n-p-1))
if Ftab>F
  fprintf('Вибірка не надійна')
else
  fprintf('вибірка надійна')  
end

%часткові рівн регресії 
yx1=(a+b1*X1+b2*mean(X2))
yx2=(a+b1*mean(X1)+b2*X2)

%часткові коеф еластичності
Eyx1=(b1*(X1./yx1))
Eyx2=(b2*(X2./yx2))

%середні коеф еластичності
EYX1=b1*(mean(X1)/mean(yx1))
EYX2=b2*(mean(X2)/mean(yx2))





